{
  "total": 6,
  "projects": [
    {
      "id": 1,
      "name": "Crypto Debit Rewards Card",
      "date_begin": "May 2022",
      "date_end": "January 2023",
      "role": "Lead Engineer/Architect",
      "description": "I worked as the project designer and lead engineer for a debit card rewards program. Using a stack of Next.js, Go, and Postgres, I launched this project from the ground up and within six months, converted our existing user base (2000+ users) and handling $200,000+ in transactions. In addition to the UI and server aspects of the project, I also implemented fraud prevention using Plaid's Auth and Identity products.",
      "image_file_name": "flycoin_debit_card.png"
    },
    {
      "id": 2,
      "name": "Machine Learning Course Teaching",
      "date_begin": "May 2021",
      "date_end": null,
      "role": "Instructor",
      "description": "I am a part-time machine learning course instructor at Inspirit AI. I have taught 300+ high school students from all over the world about the fundamentals of artificial intelligence as well as the ethical considerations it necessitates. I have supervised these students' learning progress, culminating in technical presentations on projects such as using neural networks to find exoplanets in NASA datasets and using principal component analysis to predict where Covid strains originate. I also implemented an AWS solution that allowed in-person students limited to Chromebooks to access Jupyter Notebooks via their browsers.",
      "image_file_name": "inspirit_ai.png"
    },
    {
      "id": 3,
      "name": "Industry Fraud Prevention Research",
      "date_begin": "August 2020",
      "date_end": "May 2021",
      "role": "Student Researcher",
      "description": "While I'm limited by an NDA to a vague description of this project, it has been one of my favorites because of the out-of-the-box mindset we had to adopt to solve the problem. In order to prevent avenues to fraud, we embraced the fraudster mindset and worked backwards. We designed a semi-automated web interface script to perform repeated actions on potentially dangerous targets and automatically extracted the requisite data from those actions. This would cut down the amount of manual work current industry professionals were doing.",
      "image_file_name": "jupiter.jpeg"
    },
    {
      "id": 4,
      "name": "Unix Operating System",
      "date_begin": "August 2020",
      "date_end": "December 2020",
      "description": "I developed a Unix operating system that supported dynamic memory, multiprocessing, on-disk filesystem, IPC, and a network driver for an emulated E1000 network card.",
      "image_file_name": "xv6_memory_map.png"
    },
    {
      "id": 5,
      "name": "Robosub Controls System",
      "date_begin": "September 2019",
      "date_end": "May 2021",
      "description": "I researched various control systems including MPC and LQR and implemented a robust thrust allocator for an operational AUV using the robot’s dynamics. I also organized a team of five students to develop a PID control system using ROS while teaching them C++.",
      "image_file_name": "muddsub_alfie.png"
    },
    {
      "id": 6,
      "name": "Mudd Amateur Rocketry Club: Journey to Space",
      "date_begin": "August 2018",
      "date_end": "May 2019",
      "description": "I researched different types of solid propellant fuels and helped evaluate the fuel expectations for a rocket attempting to reach 100km vertically. We decided to use Ammonium Perchlorate with HTPB as a binder and I helped manufacture a test batch with which we could perform impulse tests.",
      "image_file_name": "marc_jts.png"
    }
  ]
}
